import React from 'react'
import { createSlice } from "@reduxjs/toolkit"

const slice = createSlice({
    name: 'savvas',
    initialState: {
        cards: [
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
            {name: 'Алан Баллаев', nick: '@alan', price: 80000, text: 'Я напишу сценарий и контент для  рекламной компании'},
        ]
    },
    reducers: {
        
    }
})

export default slice.reducer
export const {} = slice.actions              